[Killed] BlockStatement
Desktop/LabFinal/src/1-BMI.js:3:71
 function calculateBMI(heightInCM, weightInKG)
 {
-    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
-        return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
+    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){} else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";
     } else {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] EqualityOperator
Desktop/LabFinal/src/1-BMI.js:3:32
 function calculateBMI(heightInCM, weightInKG)
 {
-    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
+    if((heightInCM === '') || (heightInCM <= 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] EqualityOperator
Desktop/LabFinal/src/1-BMI.js:5:16
 {
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
+    } else if (weightInKG !== '' || weightInKG < 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";
     } else {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] LogicalOperator
Desktop/LabFinal/src/1-BMI.js:5:16
 {
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
+    } else if ((weightInKG === '' || weightInKG < 0) && isNaN(weightInKG)){
         return"Please provide a valid weight";
     } else {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.
