[Killed] BlockStatement
Desktop/LabFinal/src/2-converter.js:2:1
 function WeightConverter(measurement, val)
-{
-    var result1, result2;
-
-    if(measurement == "ounces")
-    {
-        result1 = (val/16).toFixed(2) + " pounds";
-        result2 = (val/32000).toFixed(2) + " tons";
-    } else if(measurement === "pounds") {
-        result1 = (val*16).toFixed(2) + " ounces";
-        result2 = (val/2000).toFixed(2) + " tons";
-    } else if(measurement === "tons") {
-        result1 = (val*2000).toFixed(2) + " pounds";
-        result2 = (val*32000).toFixed(2) + " ounces";
-    } else {
-        return "wrong input";
-    }
-    return [result1, result2];
-}
+{}
 
 //console.log(WeightConverter("pounds", 6));
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ConditionalExpression
Desktop/LabFinal/src/2-converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "ounces")
+    if(false)
     {
         result1 = (val/16).toFixed(2) + " pounds";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ConditionalExpression
Desktop/LabFinal/src/2-converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "ounces")
+    if(true)
     {
         result1 = (val/16).toFixed(2) + " pounds";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] BlockStatement
Desktop/LabFinal/src/2-converter.js:6:5
     var result1, result2;
 
     if(measurement == "ounces")
-    {
-        result1 = (val/16).toFixed(2) + " pounds";
-        result2 = (val/32000).toFixed(2) + " tons";
-    } else if(measurement === "pounds") {
+    {} else if(measurement === "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:7:20
 
     if(measurement == "ounces")
     {
-        result1 = (val/16).toFixed(2) + " pounds";
+        result1 = (val * 16).toFixed(2) + " pounds";
         result2 = (val/32000).toFixed(2) + " tons";
     } else if(measurement === "pounds") {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:8:20
     if(measurement == "ounces")
     {
         result1 = (val/16).toFixed(2) + " pounds";
-        result2 = (val/32000).toFixed(2) + " tons";
+        result2 = (val * 32000).toFixed(2) + " tons";
     } else if(measurement === "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ConditionalExpression
Desktop/LabFinal/src/2-converter.js:9:15
     {
         result1 = (val/16).toFixed(2) + " pounds";
         result2 = (val/32000).toFixed(2) + " tons";
-    } else if(measurement === "pounds") {
+    } else if(true) {
         result1 = (val*16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] BlockStatement
Desktop/LabFinal/src/2-converter.js:9:41
     {
         result1 = (val/16).toFixed(2) + " pounds";
         result2 = (val/32000).toFixed(2) + " tons";
-    } else if(measurement === "pounds") {
-        result1 = (val*16).toFixed(2) + " ounces";
-        result2 = (val/2000).toFixed(2) + " tons";
-    } else if(measurement === "tons") {
+    } else if(measurement === "pounds") {} else if(measurement === "tons") {
         result1 = (val*2000).toFixed(2) + " pounds";
         result2 = (val*32000).toFixed(2) + " ounces";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:10:20
         result1 = (val/16).toFixed(2) + " pounds";
         result2 = (val/32000).toFixed(2) + " tons";
     } else if(measurement === "pounds") {
-        result1 = (val*16).toFixed(2) + " ounces";
+        result1 = (val / 16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
     } else if(measurement === "tons") {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:11:20
         result2 = (val/32000).toFixed(2) + " tons";
     } else if(measurement === "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
-        result2 = (val/2000).toFixed(2) + " tons";
+        result2 = (val * 2000).toFixed(2) + " tons";
     } else if(measurement === "tons") {
         result1 = (val*2000).toFixed(2) + " pounds";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ConditionalExpression
Desktop/LabFinal/src/2-converter.js:12:15
     } else if(measurement === "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
-    } else if(measurement === "tons") {
+    } else if(true) {
         result1 = (val*2000).toFixed(2) + " pounds";
         result2 = (val*32000).toFixed(2) + " ounces";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ConditionalExpression
Desktop/LabFinal/src/2-converter.js:12:15
     } else if(measurement === "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
-    } else if(measurement === "tons") {
+    } else if(false) {
         result1 = (val*2000).toFixed(2) + " pounds";
         result2 = (val*32000).toFixed(2) + " ounces";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:13:20
         result1 = (val*16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
     } else if(measurement === "tons") {
-        result1 = (val*2000).toFixed(2) + " pounds";
+        result1 = (val / 2000).toFixed(2) + " pounds";
         result2 = (val*32000).toFixed(2) + " ounces";
     } else {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] StringLiteral
Desktop/LabFinal/src/2-converter.js:13:43
         result1 = (val*16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
     } else if(measurement === "tons") {
-        result1 = (val*2000).toFixed(2) + " pounds";
+        result1 = (val*2000).toFixed(2) + "";
         result2 = (val*32000).toFixed(2) + " ounces";
     } else {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:14:20
         result2 = (val/2000).toFixed(2) + " tons";
     } else if(measurement === "tons") {
         result1 = (val*2000).toFixed(2) + " pounds";
-        result2 = (val*32000).toFixed(2) + " ounces";
+        result2 = (val / 32000).toFixed(2) + " ounces";
     } else {
         return "wrong input";
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] BlockStatement
Desktop/LabFinal/src/2-converter.js:15:12
     } else if(measurement === "tons") {
         result1 = (val*2000).toFixed(2) + " pounds";
         result2 = (val*32000).toFixed(2) + " ounces";
-    } else {
-        return "wrong input";
-    }
+    } else {}
     return [result1, result2];
 }
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.
