[Killed] BlockStatement
Desktop/LabFinal/src/3-sorting.js:1:26
-function bubbleSort(arr) {
-    let len = arr.length;
-    for (let i = 0; i < len; i++) {
-        for (let j = 0; j < len; j++) {
-            if (arr[j] > arr[j + 1]) {
-                let tmp = arr[j];
-                arr[j] = arr[j + 1];
-                arr[j + 1] = tmp;
-            }
-        }
-    }
-    return arr;
-}
+function bubbleSort(arr) {}
 console.log(bubbleSort([2,1,4,3]))
 module.exports = {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] BlockStatement
Desktop/LabFinal/src/3-sorting.js:3:35
 function bubbleSort(arr) {
     let len = arr.length;
-    for (let i = 0; i < len; i++) {
-        for (let j = 0; j < len; j++) {
-            if (arr[j] > arr[j + 1]) {
-                let tmp = arr[j];
-                arr[j] = arr[j + 1];
-                arr[j + 1] = tmp;
-            }
-        }
-    }
+    for (let i = 0; i < len; i++) {}
     return arr;
 }
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ConditionalExpression
Desktop/LabFinal/src/3-sorting.js:3:21
 function bubbleSort(arr) {
     let len = arr.length;
-    for (let i = 0; i < len; i++) {
+    for (let i = 0; false; i++) {
         for (let j = 0; j < len; j++) {
             if (arr[j] > arr[j + 1]) {
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ConditionalExpression
Desktop/LabFinal/src/3-sorting.js:4:25
 function bubbleSort(arr) {
     let len = arr.length;
     for (let i = 0; i < len; i++) {
-        for (let j = 0; j < len; j++) {
+        for (let j = 0; false; j++) {
             if (arr[j] > arr[j + 1]) {
                 let tmp = arr[j];
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] EqualityOperator
Desktop/LabFinal/src/3-sorting.js:4:25
 function bubbleSort(arr) {
     let len = arr.length;
     for (let i = 0; i < len; i++) {
-        for (let j = 0; j < len; j++) {
+        for (let j = 0; j >= len; j++) {
             if (arr[j] > arr[j + 1]) {
                 let tmp = arr[j];
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ConditionalExpression
Desktop/LabFinal/src/3-sorting.js:5:17
     let len = arr.length;
     for (let i = 0; i < len; i++) {
         for (let j = 0; j < len; j++) {
-            if (arr[j] > arr[j + 1]) {
+            if (false) {
                 let tmp = arr[j];
                 arr[j] = arr[j + 1];
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/3-sorting.js:5:30
     let len = arr.length;
     for (let i = 0; i < len; i++) {
         for (let j = 0; j < len; j++) {
-            if (arr[j] > arr[j + 1]) {
+            if (arr[j] > arr[j - 1]) {
                 let tmp = arr[j];
                 arr[j] = arr[j + 1];
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/3-sorting.js:7:30
         for (let j = 0; j < len; j++) {
             if (arr[j] > arr[j + 1]) {
                 let tmp = arr[j];
-                arr[j] = arr[j + 1];
+                arr[j] = arr[j - 1];
                 arr[j + 1] = tmp;
             }
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Killed] ArithmeticOperator
Desktop/LabFinal/src/3-sorting.js:8:21
             if (arr[j] > arr[j + 1]) {
                 let tmp = arr[j];
                 arr[j] = arr[j + 1];
-                arr[j + 1] = tmp;
+                arr[j - 1] = tmp;
             }
         }
killedBy: All tests
statusReason: > new-folder@1.0.0 test
> jest


● Validation Warning:

  Unknown option "coverageRrepoters" with value ["lcov"] was found. Did you mean "coverageReporters"?
  This is probably a typing mistake. Fixing it will remove this message.

[Survived] ArrayDeclaration
Desktop/LabFinal/src/3-sorting.js:14:24
     }
     return arr;
 }
-console.log(bubbleSort([2,1,4,3]))
+console.log(bubbleSort([]))
 module.exports = {
     bubbleSort
